RT-Thread/rt-thread/bsp/synwit/swm341/libraries/SWM341_StdPeriph_Driver/SWM341_pwm.c
        PWMx->EVMSK &= ~(PWM_EVMSK_OUTB_Msk | PWM_EVMSK_OUTBN_Msk);
        PWMx->EVMSK |= (out   << PWM_EVMSK_OUTB_Pos)  |
                       (out_n << PWM_EVMSK_OUTBN_Pos) |
                       (1     << PWM_EVMSK_IMME_Pos);
    }
}

/******************************************************************************************************************************************
* 函数名称: PWM_SetPeriod()
* 功能说明: 设置周期
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint16_t period         要设定的周期值
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_SetPeriod(PWM_TypeDef * PWMx, uint16_t period)
{
    PWMx->PERIOD = period - 1;
}

/******************************************************************************************************************************************
* 函数名称: PWM_GetPeriod()
* 功能说明: 获取周期
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
* 输    出: uint16_t              获取到的周期值
* 注意事项: 无
******************************************************************************************************************************************/
uint16_t PWM_GetPeriod(PWM_TypeDef * PWMx)
{
    return PWMx->PERIOD + 1;
}

/******************************************************************************************************************************************
* 函数名称: PWM_SetHDuty()
* 功能说明: 设置高电平时长
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint32_t chn            指定要被设置的PWM通道，有效值包括PWM_CH_A、PWM_CH_B
*           uint16_t hduty          要设定的高电平时长
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_SetHDuty(PWM_TypeDef * PWMx, uint32_t chn, uint16_t hduty)
{
    if(chn == PWM_CH_A)
        PWMx->CMPA = hduty;
    else
        PWMx->CMPB = hduty;
}

/******************************************************************************************************************************************
* 函数名称: PWM_GetHDuty()
* 功能说明: 获取高电平时长
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint32_t chn            指定要被设置的PWM通道，有效值包括PWM_CH_A、PWM_CH_B
* 输    出: uint16_t              获取到的高电平时长
* 注意事项: 无
******************************************************************************************************************************************/
uint16_t PWM_GetHDuty(PWM_TypeDef * PWMx, uint32_t chn)
{
    if(chn == PWM_CH_A)
        return PWMx->CMPA;
    else
        return PWMx->CMPB;
}

/******************************************************************************************************************************************
* 函数名称: PWM_SetHDuty2()
* 功能说明: 设置高电平时长，用于非对称中心对齐模式
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint32_t chn            指定要被设置的PWM通道，有效值包括PWM_CH_A、PWM_CH_B
*           uint16_t hduty          要设定的前半周期高电平时长
*           uint16_t hduty2         要设定的后半周期高电平时长
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_SetHDuty2(PWM_TypeDef * PWMx, uint32_t chn, uint16_t hduty, uint16_t hduty2)
{
    if(chn == PWM_CH_A)
    {
        PWMx->CMPA  = hduty;
        PWMx->CMPA2 = hduty2;
    }
    else
    {
        PWMx->CMPB  = hduty;
        PWMx->CMPB2 = hduty2;
    }
}

/******************************************************************************************************************************************
* 函数名称: PWM_GetHDuty2()
* 功能说明: 获取高电平时长，用于非对称中心对齐模式
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint32_t chn            指定要被设置的PWM通道，有效值包括PWM_CH_A、PWM_CH_B
* 输    出: uint16_t *hduty           获取到的前半周期高电平时长
*           uint16_t *hduty2        获取到的后半周期高电平时长
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_GetHDuty2(PWM_TypeDef * PWMx, uint32_t chn, uint16_t *hduty, uint16_t *hduty2)
{
    if(chn == PWM_CH_A)
    {
        *hduty  = PWMx->CMPA;
        *hduty2 = PWMx->CMPA2;
    }
    else
    {
        *hduty  = PWMx->CMPB;
        *hduty2 = PWMx->CMPB2;
    }
}

/******************************************************************************************************************************************
* 函数名称: PWM_SetDeadzone()
* 功能说明: 设置死区时长
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint32_t chn            指定要被设置的PWM通道，有效值包括PWM_CH_A、PWM_CH_B
*           uint16_t deadzone       要设定的死区时长，取值范围0--1023
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_SetDeadzone(PWM_TypeDef * PWMx, uint32_t chn, uint16_t deadzone)
{
    if(chn == PWM_CH_A)
        PWMx->DZA = deadzone;
    else
        PWMx->DZB = deadzone;
}

/******************************************************************************************************************************************
* 函数名称: PWM_GetDeadzone()
* 功能说明: 获取死区时长
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint32_t chn            指定要被设置的PWM通道，有效值包括PWM_CH_A、PWM_CH_B
* 输    出: uint16_t              获取到的死区时长
* 注意事项: 无
******************************************************************************************************************************************/
uint16_t PWM_GetDeadzone(PWM_TypeDef * PWMx, uint32_t chn)
{
    if(chn == PWM_CH_A)
        return PWMx->DZA;
    else
        return PWMx->DZB;
}


/******************************************************************************************************************************************
* 函数名称: PWM_IntEn()
* 功能说明: 中断使能
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint32_t it             interrupt type，有效值包括PWM_IT_OVF_UP、PWM_IT_OVF_DOWN、PWM_IT_CMPA_UP、PWM_IT_CMPB_UP、
*                                   PWM_IT_CMPA_DOWN、PWM_IT_CMPB_DOWN 及其“或”
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntEn(PWM_TypeDef * PWMx, uint32_t it)
{
    PWMx->IE |= it;
}

/******************************************************************************************************************************************
* 函数名称: PWM_IntDis()
* 功能说明: 中断禁能
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint32_t it             interrupt type，有效值包括PWM_IT_OVF_UP、PWM_IT_OVF_DOWN、PWM_IT_CMPA_UP、PWM_IT_CMPB_UP、
*                                   PWM_IT_CMPA_DOWN、PWM_IT_CMPB_DOWN 及其“或”
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntDis(PWM_TypeDef * PWMx, uint32_t it)
{
    PWMx->IE &= ~it;
}

/******************************************************************************************************************************************
* 函数名称: PWM_IntClr()
* 功能说明:中断标志清除
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint32_t it             interrupt type，有效值包括PWM_IT_OVF_UP、PWM_IT_OVF_DOWN、PWM_IT_CMPA_UP、PWM_IT_CMPB_UP、
*                                   PWM_IT_CMPA_DOWN、PWM_IT_CMPB_DOWN 及其“或”
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntClr(PWM_TypeDef * PWMx, uint32_t it)
{
    PWMx->IF = it;
}

/******************************************************************************************************************************************
* 函数名称: PWM_IntStat()
* 功能说明: 中断标志查询
* 输    入: PWM_TypeDef * PWMx        指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4
*           uint32_t it             interrupt type，有效值包括PWM_IT_OVF_UP、PWM_IT_OVF_DOWN、PWM_IT_CMPA_UP、PWM_IT_CMPB_UP、
*                                   PWM_IT_CMPA_DOWN、PWM_IT_CMPB_DOWN 及其“或”
* 输    出: uint32_t              0 中断标志未置起   非0 中断标志已置起
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t PWM_IntStat(PWM_TypeDef * PWMx, uint32_t it)
{
    return (PWMx->IF & it);
}

/******************************************************************************************************************************************
* 函数名称: PWM_BrkIntEn()
* 功能说明: 刹车中断使能
* 输    入: uint32_t brkit            brake interrupt type，有效值包括 PWM_BRKIT_BRK0、PWM_BRKIT_BRK0、PWM_BRKIT_BRK0 及其“或”
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_BrkIntEn(uint32_t brkit)
{
    PWMG->BRKIE |= brkit;
}

/******************************************************************************************************************************************
* 函数名称: PWM_BrkIntDis()
* 功能说明: 刹车中断禁能
* 输    入: uint32_t brkit            brake interrupt type，有效值包括 PWM_BRKIT_BRK0、PWM_BRKIT_BRK0、PWM_BRKIT_BRK0 及其“或”
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_BrkIntDis(uint32_t brkit)
{
    PWMG->BRKIE &= ~brkit;
}

/******************************************************************************************************************************************
* 函数名称: PWM_BrkIntClr()
* 功能说明:中断标志清除
* 输    入: uint32_t brkit            brake interrupt type，有效值包括 PWM_BRKIT_BRK0、PWM_BRKIT_BRK0、PWM_BRKIT_BRK0 及其“或”
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_BrkIntClr(uint32_t brkit)
{
    PWMG->BRKIF = brkit;
}

/******************************************************************************************************************************************
* 函数名称: PWM_BrkIntStat()
* 功能说明: 刹车中断标志查询
* 输    入: uint32_t brkit            brake interrupt type，有效值包括 PWM_BRKIT_BRK0、PWM_BRKIT_BRK0、PWM_BRKIT_BRK0 及其“或”
* 输    出: uint32_t              0 中断标志未置起   非0 中断标志已置起
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t PWM_BrkIntStat(uint32_t brkit)
{
    return (PWMG->BRKIF & brkit);
}
